# 【Pandas】 データフレームのフィルタリング

In [6]:
#Kaggle-> https://www.kaggle.com/c/titanic
#タイタニックデータセット (Titanic - Machine Learning from Disaster)
import pandas as pd
import numpy as np
from sklearn.datasets import load_breast_cancer

# データフレームのセット
df_taitanic = pd.read_csv("../Data/taitanic.csv")
Column_List = df_taitanic.columns

# データ形状の確認
print('--------------------------------------------------')
print('df_taitanic_shape: (%i,%i)' % df_taitanic.shape)
print('--------------------------------------------------')

df_taitanic.head()

--------------------------------------------------
df_taitanic_shape: (891,12)
--------------------------------------------------

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
#指定のカラム情報のフィルタリング　1条件

#maleだけにフィルタリング
df_taitanic_filtered_1 = df_taitanic[df_taitanic["Sex"] == "male"]
df_taitanic_filtered_1["Sex"].unique()

array(['male'], dtype=object)

In [8]:
#指定のカラム情報のフィルタリング　複数条件

#20歳以上のmaleだけにフィルタリング
df_taitanic_filtered_2 = df_taitanic[(df_taitanic["Sex"] == "male") & (df_taitanic["Age"] > 20)]
print(df_taitanic_filtered_2["Sex"].unique())
print(df_taitanic_filtered_2["Age"].unique())

['male']
[22.  35.  54.  39.  34.  28.  40.  66.  42.  21.  65.  28.5 45.  26.
 32.  25.  29.  24.  46.  59.  71.  23.  33.  37.  38.  47.  70.5 32.5
 27.  36.5 51.  55.5 40.5 30.  44.  61.  56.  36.  45.5 20.5 62.  52.
 23.5 43.  50.  64.  31.  49.  48.  58.  55.  60.  57.  80.  70.  24.5
 41.  30.5 34.5 74. ]

In [9]:
#カテゴリー情報の複数条件フィルタリング

#Pclass 1,2,3のうち1,2のみにフィルタリング
df_taitanic_filtered_3 = df_taitanic[df_taitanic["Pclass"].isin([1,2])]

df_taitanic_filtered_3["Pclass"].unique()

array([1, 2], dtype=int64)